package sem02;

/*
 * Дана json строка (можно сохранить в файл и читать из файла)
 * [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
 *  {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
 *  {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
 * Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
 */
public class task2_3 {
    public static void main(String[] args) {
        
    }
}
